Res-container-random-v6/container_t_10_c_30_frontCore_1_wrkCore_2/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4777.899ms, rate sampling interval: 18776ms
  Thread calibration: mean lat.: 4773.177ms, rate sampling interval: 18759ms
  Thread calibration: mean lat.: 4772.365ms, rate sampling interval: 18546ms
  Thread calibration: mean lat.: 4974.464ms, rate sampling interval: 18563ms
  Thread calibration: mean lat.: 5011.596ms, rate sampling interval: 18939ms
  Thread calibration: mean lat.: 4967.210ms, rate sampling interval: 18726ms
  Thread calibration: mean lat.: 4817.688ms, rate sampling interval: 18661ms
  Thread calibration: mean lat.: 4935.569ms, rate sampling interval: 18546ms
  Thread calibration: mean lat.: 4977.175ms, rate sampling interval: 18530ms
  Thread calibration: mean lat.: 4911.374ms, rate sampling interval: 18513ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    35.40s    14.21s    0.99m    58.06%
    Req/Sec    37.60      3.31    42.00     85.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   35.26s 
 75.000%   47.84s 
 90.000%    0.91m 
 99.000%    0.99m 
 99.900%    1.00m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10027.007     0.000000            1         1.00
   15261.695     0.100000         1923         1.11
   20987.903     0.200000         3842         1.25
   26034.175     0.300000         5762         1.43
   31424.511     0.400000         7689         1.67
   35258.367     0.500000         9613         2.00
   36929.535     0.550000        10564         2.22
   39714.815     0.600000        11533         2.50
   42434.559     0.650000        12490         2.86
   45055.999     0.700000        13450         3.33
   47841.279     0.750000        14414         4.00
   49250.303     0.775000        14911         4.44
   50266.111     0.800000        15372         5.00
   51511.295     0.825000        15859         5.71
   52494.335     0.850000        16337         6.67
   53641.215     0.875000        16815         8.00
   54198.271     0.887500        17057         8.89
   54820.863     0.900000        17298        10.00
   55574.527     0.912500        17526        11.43
   56262.655     0.925000        17770        13.33
   57016.319     0.937500        18024        16.00
   57343.999     0.943750        18128        17.78
   57704.447     0.950000        18258        20.00
   58097.663     0.956250        18374        22.86
   58425.343     0.962500        18487        26.67
   58621.951     0.968750        18627        32.00
   58687.487     0.971875        18674        35.56
   58785.791     0.975000        18737        40.00
   58884.095     0.978125        18801        45.71
   59015.167     0.981250        18855        53.33
   59179.007     0.984375        18912        64.00
   59277.311     0.985938        18942        71.11
   59342.847     0.987500        18972        80.00
   59441.151     0.989062        18999        91.43
   59539.455     0.990625        19028       106.67
   59637.759     0.992188        19059       128.00
   59703.295     0.992969        19086       142.22
   59703.295     0.993750        19086       160.00
   59736.063     0.994531        19107       182.86
   59768.831     0.995313        19116       213.33
   59801.599     0.996094        19138       256.00
   59834.367     0.996484        19153       284.44
   59834.367     0.996875        19153       320.00
   59867.135     0.997266        19166       365.71
   59867.135     0.997656        19166       426.67
   59899.903     0.998047        19188       512.00
   59899.903     0.998242        19188       568.89
   59899.903     0.998437        19188       640.00
   59899.903     0.998633        19188       731.43
   59899.903     0.998828        19188       853.33
   59899.903     0.999023        19188      1024.00
   59932.671     0.999121        19198      1137.78
   59932.671     0.999219        19198      1280.00
   59932.671     0.999316        19198      1462.86
   59932.671     0.999414        19198      1706.67
   59932.671     0.999512        19198      2048.00
   59932.671     0.999561        19198      2275.56
   59965.439     0.999609        19206      2560.00
   59965.439     1.000000        19206          inf
#[Mean    =    35404.209, StdDeviation   =    14212.229]
#[Max     =    59932.672, Total count    =        19206]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23073 requests in 1.00m, 9.58MB read
  Socket errors: connect 0, read 0, write 0, timeout 168
Requests/sec:    384.38
Transfer/sec:    163.49KB